let c = console.log.bind(this);
console.log('Task 1');

/*1. Сделайте функцию, которая отнимает от первого числа второе и делит на 
третье. Числа передаются параметром.*/

c('\n');
console.log('Task 2');
/*2. Сделайте функцию, которая возвращает куб числа и его квадрат. Число 
передается параметром.*/

c('\n');
console.log('Task 3');
/*3. Напишите функции min и max, которые возвращают меньшее и большее из
чисел a и b.*/

c('\n');
console.log('Task 4');
/*4. Напишите две функции: первая ф-ция должна возвращать массив с 
числовыми значениями, диапазон которых должен вводиться пользователем 
с клавиатуры; вторая – выводить полученный массив.*/

c('\n');
console.log('Task 5');
/*5. Сделайте функцию isEven() (even - это четный), которая параметром 
принимает целое число и проверяет: четное оно или нет. Если четное - пусть 
функция возвращает true, если нечетное — false.*/

c('\n');
console.log('Task 6');
/*6. Напишите ф-цию, в которую передается массив с целыми числами. 
Верните новый массив, где останутся лежать только четные из этих чисел. 
Для этого используйте вспомогательную функцию isEven из предыдущей 
задачи.*/

c('\n');
console.log('Task 7');
/*7. Напишите ф-цию, которая рисует следующую пирамидку (исп. вложенные 
циклы):
1 
22 
333 
4444 
55555 
666666 
7777777 
88888888
999999999
Кол-во рядов должно вводиться параметром. Если пользователь ввел доп. 
параметр, непредусмотренный ф-цией по умолчанию - один любой символ, 
кроме пробела, то пирамида должна быть нарисована этим символом, 
например: 
* 
** 
*** 
**** 
***** 
****** 
******* 
******** 
********* */

c('\n');
console.log('Task 8');
/*8. Напишите ф-цию, которая рисует равнобедренный треугольник из 
звездочек:
* 
*** 
***** 
******* 
********* 
Кол-во рядов должно вводиться с клавиатуры. Доп., напишите такую же ф-
цию, но которая выведет перевернутый треугольник. */

c('\n');
console.log('Task 9');
/*9. Напишите ф-цию, которая возвращает массив заполненный числами 
Фибоначи от 0 до 1000.*/


c('\n');
console.log('Task 10');
/*10. Дано число. Сложите его цифры. Если сумма получилась более 9-ти, 
опять сложите его цифры. И так, пока сумма не станет однозначным числом 
(9 и менее). Исп. Рекурсию.*/


c('\n');
console.log('Task 11');
/*11. Дан массив с числами (передается параметром). Выведите 
последовательно его элементы, используя рекурсию и не используя цикл.*/


c('\n');
console.log('Task 12');
/*12. Напишите ф-цию, запрашивающую имя, фамилия, отчество и номер 
группы студента и выводящую введённые данные в следующем виде:
***************************** 
* Домашняя работа: «Функции» * 
* Выполнил: студент гр. W4017  * 
* Иванов Иван Иванович             * 
***************************** 
Размер рамки должен определятся автоматически по самой длинной строке. 
Рамку вывести в консоль. */



c('\n');
console.log('Task 13');
/*13. Напишите ф-цию, которая должна проверить правильность ввода адреса 
эл. почты, неиспользуя регулярные выражения. Почта верна при условии:
a. весь адрес не должен содержать русские буквы и спецсимволы, кроме 
одной «собачки», знака подчеркивания, дефиса и точки, причем они не могут
быть первыми и последними в адресе, и идти подряд, например: «..», «@.», 
«.@» или «@@», «_@», «@-», «--» и т.п. 
b. имя эл. почты (до знака @) должно быть длиной более 2 символов, причем 
имя может содержать только буквы, цифры, но не быть первыми и 
единственными в имени, и точку; 
c. после последней точки и после @, домен верхнего уровня (ru, by, com и 
т.п.) не может быть длиной менее 2 и более 11 символов. */


